/******************************************************************************
*
* LScript Introduction:
* LScript is a tiny scripting engine for the 2.6 version of the AAO game.  
* LScript connects a Lua scripting engine up to the 2.6 game engine.  You 
* can learn more about the Lua scripting language here:
* http://www.lua.org
*
* There is a LScript.txt file that describes how to use this code from Lua.
*
* How to build LScript:
*   1. Download the Lua 5.1 source code from the Lua site.
*   2. Copy all the files from lua-5.1/src directory into your build directory.
*   3. Delete the lua.c and luac.c files.
*   4. Copy this file into the build directory.
*   5. Create a project that includes all the files in the build directory.
*   6. Build it.
*
* Picklelicious	1  Apr 2006	Original Version - April fools day
* Temp2			5  Nov 2006 Converted for AA 2.7.0 - Fireworks night
* Temp2			6  Nov 2006 Ported to UT3369 - Melbourne Cup
* SmokeZ		13 Nov 2006 Added Some Extra Features + Fixed Common Compiler Errors
* Temp2			13 Nov 2006 Changed some stuff for VS 2005
* Temp2			15 Nov 2006 New hooks
* Temp2			24 Dec 2006 Converted for AA 2.8.0 - Christmas Eve
* Temp2			4  Apr 2007 Converted for AA 2.8.1 - Easter Parade.
******************************************************************************/

#define _CRT_SECURE_NO_DEPRECATE 1
#define _CRT_NONSTDC_NO_DEPRECATE 1
//#define _CRT_SECURE_CPP_OVERLOAD_STANDARD_NAMES 1

/* 
	USER CONFIG
*/
	
#define DEFAULT_BOTFILE		"default.lua"
#define DEFAULT_LOGFILE		"default.log"

#define BASEKEY			VK_MENU		//,VK_SHIFT
#define RESTART_KEY		'r'		//BASEKEY + <your_key>
#define OPEN_LOG_KEY		'l'		//BASEKEY + <your_key>
#define OPEN_LUA_CONSOLE	'c'		//BASEKEY + <your_key>

/*
	USER CONFIG END
*/

#include <windows.h>
#include <fcntl.h>
#include <io.h>
#include <process.h>
#include <time.h>

extern "C" 
{
#include "lua.h"
#include "lualib.h"
#include "lauxlib.h"
}

#define EngineUFunction "Engine.UFunction"
#define EngineUObject   "Engine.UObject"
#define EngineUProperty "Engine.UProperty"
#define MaxFullNameSize 512
#define MaxNameSize     128
#define NoIndex         0x7FFFFFFF


/******************************************************************************
*
* LogFile
*
******************************************************************************/
FILE* hLogFile;
char szLogFile[MAX_PATH];
bool bLogActive = false;

void Log(char * pFormat, ...)
{
	va_list     ArgList;
	char        Line[32];
	time_t      Time;
	struct tm * TM;

	if(hLogFile && bLogActive)
	{
		Time = time(0);
		TM = localtime(&Time);
		strftime(Line, sizeof(Line), "%H:%M:%S ", TM);
		fwrite(Line, strlen(Line), 1, hLogFile);

		va_start(ArgList, pFormat);
		vfprintf(hLogFile, pFormat, ArgList);
		va_end(ArgList);

		fprintf(hLogFile, "\n");
		fflush(hLogFile);
	}
}


/******************************************************************************
*
* Game Engine
*
******************************************************************************/
template<class Type> struct TArray
{
	Type * pArray;
	DWORD  Count;
	DWORD  Max;
};


typedef DWORD FName;


struct FNameEntry
{
	int   FNameIndex;
	DWORD Unknown0x004;
	DWORD Unknown0x008;
	WCHAR Name[1];
};


struct UClass;
struct UObject
{
	DWORD **     pVMT;				//0x0000
	DWORD        ObjectInternal;			//0x0004
	UObject *    pHash;				//0x0008
	DWORD *      pFrame;				//0x000C
	DWORD *      pLinkerLoad;			//0x0010
	int          PackageNumber;			//0x0014
	DWORD        Unknown0x0018;			//0x0018
	UObject *    pOuter;				//0x001C
	DWORD        ObjectFlags;			//0x0020
	FName        Name;				//0x0024
	UClass *     pClass;				//0x0028

	FName        LastStateName;			//0x002C
	FName        LastLabelName;			//0x0030
	unsigned int bDisableStateChange : 1;		//0x0034


	void GetCPPName(char * pBuffer);
	void GetFullName(char * pBuffer);
	void GetName(char * pBuffer);
	int  IsA(UClass * pClass);
};


struct UField : UObject 
{
	UField *           pSuper;			//0x0038
	UField *           pNext;			//0x003C
	DWORD              Unknown0x003C;		//0x0040
};

struct ULevel : UObject
{
	char               Unknown0x0034;		//0x0038
	TArray<UObject *>  ActorArray;			//0x003C
};

struct UProperty : UField 
{
	DWORD              ElementCount;		//0x0044
	DWORD              ElementSize;			//0x0048
	DWORD              Flags;			//0x004C
	WORD               ReplicationOffset;		//0x0050
	WORD               Unknown0x0050;		//0x0052
	WORD               Unknown0x0052;		//0x0054
	DWORD              CStructOffset;		//0x0058
	char               Unknown0x005C[0x20];
	UClass *           pRelatedClass;		//0x007C
};

struct UStruct : UField 
{
	DWORD              Unknown0x0040;		//0x0044
	DWORD              Unknown0x0044;		//0x0048
	UField *           pChildren;			//0x004C
	DWORD              Size;			//0x0050
	DWORD              Unknown0x0050;		//0x0054
	TArray<BYTE>       Script;			//0x0058
	char               Unknown0x0060[0x02C];
};


struct UFunction : UStruct 
{
	DWORD              Flags;			//0x0090
	WORD               NativeIndex;			//0x0094
	WORD               ReplicationOffset;		//0x0096
	DWORD              Unknown0x094;		//0x0098
	DWORD              Unknown0x098;		//0x009C
	DWORD              pExecFunction;		//0x00A0
};


struct UState : UStruct 
{
};


struct UClass : UState 
{
};


struct AActor : UObject
{
	char               Unknown0x0034[0x104];
	ULevel *           XLevel;			//0x0134 013c
};


struct UViewport : UObject
{
	char               Unknown0x0034[0x008];
	AActor *           Actor;			//0x003C
};


TArray<UObject *> *    pAActorArray;
TArray<FNameEntry *> * pFNameEntryArray;
TArray<UObject *> *    pUObjectArray;
UObject **             pUObjectHash;

UViewport *            pViewport;

UClass *               pActorClass;
UClass *               pClassClass;
UClass *               pFunctionClass;
UClass *               pStructClass;

UClass *               pArrayPropertyClass;
UClass *               pBoolPropertyClass;
UClass *               pBytePropertyClass;
UClass *               pClassPropertyClass;
UClass *               pDelegatePropertyClass;
UClass *               pFixedArrayPropertyClass;
UClass *               pFloatPropertyClass;
UClass *               pIntPropertyClass;
UClass *               pMapPropertyClass;
UClass *               pNamePropertyClass;
UClass *               pObjectPropertyClass;
UClass *               pPointerPropertyClass;
UClass *               pPropertyClass;
